import { Notice } from "@/types/notice";

export const fakeNotices: Notice[] = [
  {
    id: 1,
    title: "২০২৬-২০২৭ শিক্ষাবর্ষে ভর্তির বিজ্ঞপ্তি",
    content:
      "২৮ শে মার্চ থেকে সকল বিভাগে ভর্তি চলবে। ইনশা আল্লাহ। ভর্তির জন্য যোগাযোগ করুন 01723567282 নাম্বারে।",
    date: "2025-03-15",
    category: "ভর্তি",
    isImportant: true,
    slug: "admission-notice-2026-2027",
  },
  {
    id: 2,
    title: "ঈদুল ফিতরের ছুটির নোটিশ",
    content:
      "১৩ই মার্চ থেকে নূরানী বিভাগ  এবং ১৭ই মার্চ থেকে নাজেরা ও নূরণী বিভাগ  ২৭ শে মার্চ পর্যন্ত  সকল অফিসিয়াল কার্যক্রম বন্ধ থাকবে। নাজেরা এবং নূরানী বিভাগে বিভাগের শিক্ষার্থীরা অবশ্যই শুক্রবার বিকেলে মাদরাসায় উপস্থিত হবে। ইনশা আল্লহ।",
    date: "2026-03-15",
    category: "ছুটি",
    isImportant: true,
    slug: "eid-holiday-notice-2026",
  },
  // {
  //   id: 3,
  //   title: "বার্ষিক মাহফিল ও পুরস্কার বিতরণী",
  //   content:
  //     "আগামী ২৫ জানুয়ারি ২০২৫ মাদ্রাসার বার্ষিক মাহফিল ও পুরস্কার বিতরণী অনুষ্ঠান অনুষ্ঠিত হবে। সকল অভিভাবক ও শিক্ষার্থীদের উপস্থিত থাকার জন্য অনুরোধ করা হচ্ছে।",
  //   date: "2025-01-08",
  //   category: "অনুষ্ঠান",
  //   isImportant: false,
  //   slug: "annual-mahfil-2025",
  // },
  // {
  //   id: 4,
  //   title: "শীতকালীন ছুটির নোটিশ",
  //   content:
  //     "১৫ ডিসেম্বর থেকে ৩১ ডিসেম্বর পর্যন্ত শীতকালীন ছুটি। ১ জানুয়ারি থেকে স্বাভাবিক কার্যক্রম শুরু হবে।",
  //   date: "2024-12-10",
  //   category: "ছুটি",
  //   isImportant: false,
  //   slug: "winter-holiday-notice",
  // },
  // {
  //   id: 5,
  //   title: "মাসিক বেতন পরিশোধের নোটিশ",
  //   content:
  //     "প্রতি মাসের ১ থেকে ১০ তারিখের মধ্যে মাসিক বেতন পরিশোধ করতে হবে। নির্ধারিত সময়ের মধ্যে বেতন না দিলে বিলম্ব ফি প্রযোজ্য হবে।",
  //   date: "2024-12-01",
  //   category: "আর্থিক",
  //   isImportant: false,
  //   slug: "monthly-fee-notice",
  // },
];
